# Pandas Basic

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86, 1, 2], 'Y':[84,94,89,83,86, 1, 0],'Z':[86,97,96,72,83, 2, 0]});
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83
5   1   1   2
6   2   0   0

In [3]:
df.head(3)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96

In [4]:
df.tail(3)

    X   Y   Z
4  86  86  83
5   1   1   2
6   2   0   0

In [5]:
df.shape

(7, 3)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       7 non-null      int64
 1   Y       7 non-null      int64
 2   Z       7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [7]:
df.describe()

               X          Y          Z
count   7.000000   7.000000   7.000000
mean   61.142857  62.428571  62.285714
std    41.143767  42.461187  42.703295
min     1.000000   0.000000   0.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       7 non-null      int64
 1   Y       7 non-null      int64
 2   Z       7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [9]:
df[['Y', 'Z', 'X']]

    Y   Z   X
0  84  86  78
1  94  97  85
2  89  96  96
3  83  72  80
4  86  83  86
5   1   2   1
6   0   0   2

In [10]:
df.iloc[:,0]

0    78
1    85
2    96
3    80
4    86
5     1
6     2
Name: X, dtype: int64

In [11]:
df.iloc[:, 1]

0    84
1    94
2    89
3    83
4    86
5     1
6     0
Name: Y, dtype: int64

In [12]:
df.iloc[3:5, 2]

3    72
4    83
Name: Z, dtype: int64

In [13]:
s = pd.Series([2, 4, 6, 8, 10])
print(s)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [14]:
s.value_counts(dropna = False)

8     1
10    1
2     1
4     1
6     1
dtype: int64

In [15]:
df.apply(np.median)

X    80.0
Y    84.0
Z    83.0
dtype: float64

In [16]:
df.apply(np.mean)

X    61.142857
Y    62.428571
Z    62.285714
dtype: float64

In [17]:
df.apply(np.std)

X    38.091726
Y    39.311420
Z    39.535569
dtype: float64

In [18]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [19]:
df.columns = ['apple', 'banana', 'orange']

In [20]:
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       2
6      2       0       0

In [21]:
df.describe()

           apple     banana     orange
count   7.000000   7.000000   7.000000
mean   61.142857  62.428571  62.285714
std    41.143767  42.461187  42.703295
min     1.000000   0.000000   0.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [22]:
df['banana'].mean()

62.42857142857143

In [23]:
df['banana'].max()

94

In [24]:
df['banana'].min()

0

In [25]:
df['banana'].std()

42.46118675864325

In [26]:
df['banana'].sort_values(ascending = False)

1    94
2    89
4    86
0    84
3    83
5     1
6     0
Name: banana, dtype: int64

In [27]:
df['banana'].count()

7

In [28]:
df['apple'].mean()

61.142857142857146

In [29]:
df['apple'].max()

96

In [30]:
df['apple'].min()

1

In [31]:
df['apple'].std()

41.143766524341494

In [32]:
df['banana'].sort_values(ascending = False)

1    94
2    89
4    86
0    84
3    83
5     1
6     0
Name: banana, dtype: int64

In [33]:
df.mean()

apple     61.142857
banana    62.428571
orange    62.285714
dtype: float64

In [34]:
df.max()

apple     96
banana    94
orange    97
dtype: int64

In [35]:
df.min()

apple     1
banana    0
orange    0
dtype: int64

In [36]:
df.std()

apple     41.143767
banana    42.461187
orange    42.703295
dtype: float64

In [37]:
df['orange'].mean()

62.285714285714285

In [38]:
df['orange'].max()

97

In [39]:
df['orange'].min()

0

In [40]:
df['orange'].std()

42.70329528937349

In [41]:
df['orange'].median()

83.0

In [42]:
df.count()

apple     7
banana    7
orange    7
dtype: int64

In [43]:
df['orange'].sort_values(ascending = False)

1    97
2    96
0    86
4    83
3    72
5     2
6     0
Name: orange, dtype: int64

In [44]:
df[df.orange>=70]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [45]:
df[(df.orange>=70) & (df.apple>= 90)]

   apple  banana  orange
2     96      89      96

In [46]:
df['banana'] = df['banana'].replace(84, 50)

In [47]:
df

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       2
6      2       0       0

In [52]:
df['apple'] = df['apple'].replace(80, 20)

In [53]:
df.iloc[1,1]

94

In [65]:
df['apple'] = df.iloc[3,0].replace(80, 30)

AttributeError: 'numpy.int64' object has no attribute 'replace'

In [66]:
df

   apple  banana  orange
0     78      50      86
1     20      94      97
2     96      89      96
3     20      83      72
4     86      86      83
5      1       1       2
6      2       0       0